Австралия/src/InformationRegisters/NumberingIndexes/NumberingIndexes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>NumberingIndexes</name>
  <resources>
    <name>Index</name>
    <type>
      <types>DefinedType.NumberingIndex</types>
    </type>
  </resources>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Object</name>
    <type>
      <types>EnumRef.OperationTypesGoodsIssue</types>
      <types>EnumRef.OperationTypesDebitNote</types>
      <types>EnumRef.OperationTypesSupplierInvoice</types>
      <types>EnumRef.OperationTypesTaxInvoiceReceived</types>
      <types>CatalogRef.BusinessUnits</types>
      <types>EnumRef.OperationTypesPurchaseOrder</types>
      <types>EnumRef.OperationTypesOnlinePayment</types>
      <types>EnumRef.OperationTypesPaymentExpense</types>
      <types>EnumRef.OperationTypesPaymentReceipt</types>
      <types>EnumRef.OperationTypesGoodsReceipt</types>
      <types>EnumRef.OperationTypesEmployeeTask</types>
      <types>EnumRef.OperationTypesCashReceipt</types>
      <types>EnumRef.OperationTypesSalesInvoice</types>
      <types>EnumRef.OperationTypesInventoryTransfer</types>
      <types>EnumRef.OperationTypesSalesOrder</types>
      <types>EnumRef.OperationTypesTaxAccrual</types>
      <types>EnumRef.OperationTypesProduction</types>
      <types>EnumRef.OperationTypesCustomsDeclaration</types>
      <types>EnumRef.OperationTypesTransferAndPromotion</types>
      <types>EnumRef.OperationTypesTransferOrder</types>
      <types>EnumRef.OperationTypesPayrollSheet</types>
      <types>EnumRef.OperationTypesCashVoucher</types>
      <types>CatalogRef.Companies</types>
      <types>EnumRef.OperationTypesOnlineReceipt</types>
      <types>EnumRef.OperationTypesGoodsReturn</types>
      <types>EnumRef.OperationTypesIntraWarehouseTransfer</types>
      <types>EnumRef.OperationTypesArApAdjustments</types>
      <types>EnumRef.OperationTypesProductionOrder</types>
      <types>EnumRef.LoanAccrualTypes</types>
      <types>CatalogRef.Counterparties</types>
      <types>EnumRef.OperationTypesKitOrder</types>
      <types>EnumRef.OperationTypesAdditionalExpenses</types>
      <types>EnumRef.OperationTypesTaxInvoiceIssued</types>
      <types>EnumRef.OperationTypesCreditNote</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Австралия/src/InformationRegisters/NumberingIndexes/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Public

// Sets an index value for the passed object.
//
// Parameters:
// Object - CatalogRef.Counterparties,
//           CatalogRef.EnterpriseStructure,
//           CatalogRef.InternalDocumentsKinds,
//           CatalogRef.Companies,
//           CatalogRef.IncomingDocumentsKinds,
//           CatalogRef.ActivityIssues,
//           CatalogRef.OutgoingDocumentsKinds - a reference to the object the numbering index is being set for.
// Index - String - an index to set.
//
Procedure WriteNumberingIndex(Object, Index) Export
	
	Record = InformationRegisters.NumberingIndexes.CreateRecordManager();
	Record.Object = Object;
	Record.Read();
	
	Record.Object = Object;
	Record.Index = Index;
	Record.Write(True);
	
EndProcedure

// Returns a numbering index value of the passed object.
//
// Parameters:
// Object - CatalogRef.Counterparties,
//           CatalogRef.EnterpriseStructure,
//           CatalogRef.InternalDocumentsKinds,
//           CatalogRef.Companies,
//           CatalogRef.IncomingDocumentsKinds,
//           CatalogRef.ActivityIssues,
//           CatalogRef.OutgoingDocumentsKinds - a reference to the object the numbering index is being got for.
//
Function GetNumberingIndex(Object) Export
	
	Record = InformationRegisters.NumberingIndexes.CreateRecordManager();
	Record.Object = Object;
	Record.Read();
	
	Return TrimAll(Record.Index);
	
EndFunction

// Deletes an index value for the passed object.
//
// Parameters:
// Object - CatalogRef.Counterparties,
//           CatalogRef.EnterpriseStructure,
//           CatalogRef.InternalDocumentsKinds,
//           CatalogRef.Companies,
//           CatalogRef.IncomingDocumentsKinds,
//           CatalogRef.ActivityIssues,
//           CatalogRef.OutgoingDocumentsKinds - a reference to the object the numbering index is being deleted for.
//
Procedure DeleteNumberingIndex(Object) Export
	
	Record = InformationRegisters.NumberingIndexes.CreateRecordManager();
	Record.Object = Object;
	Record.Delete();
	
EndProcedure

#EndRegion

#Region Private

Procedure FillTypesList(TypesList) Export
	
	Types = Metadata.InformationRegisters.NumberingIndexes.Dimensions.Object.Type.Types();
	
	For Each ObjectType In Types Do
		
		ObjectRef = New(ObjectType);
		
		ObjectMetadata = ObjectRef.Metadata();
		
		Presentation = ObjectMetadata.ListPresentation;
		If IsBlankString(Presentation) Then
			Presentation = ObjectMetadata.Synonym;
		EndIf;
		
		TypesList.Add(ObjectType, Presentation);
		
	EndDo;
	
	TypesList.SortByPresentation();
	
EndProcedure

#EndRegion

#EndIf
